---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Onbayeva_Sabira\Desktop\final_project\scripts\stata\main.lo
> g
  log type:  text
 opened on:   6 Nov 2024, 21:03:59

. 
. // *** Folder Structure ***
. 
. cap mkdir data               

. cap mkdir output             

. cap mkdir output/graphs      

. cap mkdir output/tables      

. cap mkdir scripts

. cap mkdir scripts/stata

. cap mkdir scripts/python

.            
. //***Loading and Inspecting the Dataset***
. 
. import delimited "C:/Users/Onbayeva_Sabira/Desktop/final_project/data/used_cars
> _2cities.csv", varnames(1) bindquotes(strict) encoding("utf-8") clear
(15 vars, 1,095 obs)

. browse

. describe

Contains data
 Observations:         1,095                  
    Variables:            15                  
---------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------
v1              int     %8.0g                 
price           str6    %9s                   
area            str11   %11s                  
subarea         str20   %20s                  
name            str51   %51s                  
condition       str9    %9s                   
cylinders       str11   %11s                  
drive           str3    %9s                   
fuel            str6    %9s                   
odometer        str7    %9s                   
paintcolor      str6    %9s                   
size            str11   %11s                  
transmission    str9    %9s                   
type            str11   %11s                  
dealer          byte    %8.0g                 
---------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          v1 |      1,095    578.3562    342.6643          1       1199
       price |          0
        area |          0
     subarea |          0
        name |          0
-------------+---------------------------------------------------------
   condition |          0
   cylinders |          0
       drive |          0
        fuel |          0
    odometer |          0
-------------+---------------------------------------------------------
  paintcolor |          0
        size |          0
transmission |          0
        type |          0
      dealer |      1,095    .3050228    .4606275          0          1

. 
. //***Data Cleaning and Preparation***
. do data_cleaning.do

. //Clean Missing Data
. drop if missing(price)| missing(subarea) | missing(condition) | missing(cylinde
> rs) | missing(drive) | missing(paintcolor) | missing(size) | missing(type) | mi
> ssing(odometer)
(0 observations deleted)

. 
. destring odometer, replace
odometer: contains nonnumeric characters; no replace

. 
. replace price = subinstr(price, "$", "", .)  // Remove "$" sign
(1,011 real changes made)

. destring price, replace  // Convert to numeric
price: contains nonnumeric characters; no replace

. 
. replace cylinders = subinstr(cylinders, " cylinders", "", .) // Remove " cylind
> ers" destring cylinders 
(704 real changes made)

. destring cylinders, replace // Convert to numeric
cylinders: contains nonnumeric characters; no replace

. 
. //Filter and Transform Data
. 
end of do-file

. 
end of do-file

. do "C:\Users\Onbayeva_Sabira\Desktop\final_project\scripts\stata\final_project.
> do"

. cd "C:/Users/Onbayeva_Sabira/Desktop/final_project"
C:\Users\Onbayeva_Sabira\Desktop\final_project

. 
. clear all

. set more off, permanently
(set more preference recorded)

. 
. // Start a log file to capture the output, using the same name as the main scri
> pt
. capture log close
